cavidade/icoFoam/Re-4030-v10/m02/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.0025;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{
    linhaDeCorrente
    {
        type            streamlines;
        libs            ("libfieldFunctionObjects.so");

	executeControl  writeTime;
	writeControl    writeTime;
        setFormat       vtk;		

        lifeTime        1000;
	nSubCycle       5;
        U               U;
	direction       both;
        fields
	( U );

        seedSampleSet
        {
            type        lineUniform;
            axis        x;  		
            start       (0.1 0   0.005);
            end         (0   0.1 0.005);
            nPoints     250;
        }
    }
}



// ************************************************************************* //
